garyPenhook/PyAvrOCD/svd/atmega169p.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>JTAG</name>
      <description>JTAG Interface</description>
      <baseAddress>0x00800051</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>JTD</name>
              <description>JTAG Interface Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUSR</name>
          <description>MCU Status Register (read-only for debugger)</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>JTRF</name>
              <description>JTAG Reset Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCDR</name>
          <description>On-Chip Debug Related Register in I/O Memory (write-only for debugger)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LCD</name>
      <description>Liquid Crystal Display</description>
      <baseAddress>0x008000E4</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x12</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x17</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LCDCCR</name>
          <description>LCD Contrast Control Register</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LCDCC</name>
              <description>LCD Contrast Controls</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2_60V</name>
                  <description>2.60V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_65V</name>
                  <description>2.65V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_70V</name>
                  <description>2.70V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_75V</name>
                  <description>2.75V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_80V</name>
                  <description>2.80V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_85V</name>
                  <description>2.85V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_90V</name>
                  <description>2.90V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_95V</name>
                  <description>2.95V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_00V</name>
                  <description>3.00V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_05V</name>
                  <description>3.05V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_10V</name>
                  <description>3.10V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_15V</name>
                  <description>3.15V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_20V</name>
                  <description>3.20V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_25V</name>
                  <description>3.25V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_30V</name>
                  <description>3.30V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_35V</name>
                  <description>3.35V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDMDT</name>
              <description>LCD Maximum Drive Time</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDDC</name>
              <description>LCD Display Configuration Bits</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>300US</name>
                  <description>300us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>70US</name>
                  <description>70us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>150US</name>
                  <description>150us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>450US</name>
                  <description>450us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>575US</name>
                  <description>575us</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>850US</name>
                  <description>850us</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1150US</name>
                  <description>1150us</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>50_PERCENT_OF_LCD_CLOCK</name>
                  <description>50% of LCD clock</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCRA</name>
          <description>LCD Control Register A (read-only for debugger)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LCDBL</name>
              <description>LCD Blanking</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCCD</name>
              <description>LCD Contrast Control Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDBD</name>
              <description>LCD Buffer Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDIE</name>
              <description>LCD Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDIF</name>
              <description>LCD Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDAB</name>
              <description>LCD A or B waveform</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDEN</name>
              <description>LCD Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCRB</name>
          <description>LCD Control and Status Register B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LCDPM</name>
              <description>LCD Port Masks</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEG0_12</name>
                  <description>SEG0:12</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_14</name>
                  <description>SEG0:14</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_15</name>
                  <description>SEG0:15</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_18</name>
                  <description>SEG0:18</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_20</name>
                  <description>SEG0:20</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_22</name>
                  <description>SEG0:22</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_23</name>
                  <description>SEG0:23</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEG0_24</name>
                  <description>SEG0:24</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDMUX</name>
              <description>LCD Mux Selects</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LCD2B</name>
              <description>LCD 1/2 Bias Select</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCS</name>
              <description>LCD CLock Select</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDDR0</name>
          <description>LCD Data Register 0</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR1</name>
          <description>LCD Data Register 1</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR10</name>
          <description>LCD Data Register 10</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR11</name>
          <description>LCD Data Register 11</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR12</name>
          <description>LCD Data Register 12</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR13</name>
          <description>LCD Data Register 13</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR15</name>
          <description>LCD Data Register 15</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR16</name>
          <description>LCD Data Register 16</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR17</name>
          <description>LCD Data Register 17</description>
          <addressOffset>0x19</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR18</name>
          <description>LCD Data Register 18</description>
          <addressOffset>0x1A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR2</name>
          <description>LCD Data Register 2</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR3</name>
          <description>LCD Data Register 3</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR5</name>
          <description>LCD Data Register 5</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR6</name>
          <description>LCD Data Register 6</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR7</name>
          <description>LCD Data Register 7</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDDR8</name>
          <description>LCD Data Register 8</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
